desc = """
Создайте класс Калькулятор. В классе должна быть 
реализована следующая функциональность:
■ Сложение двух чисел;
■ Вычитание двух чисел;
■ Умножение двух чисел;
■ Деление двух чисел;
■ Максимум из двух чисел;
■ Минимум из двух чисел;
■ Процент числа;
■ Возведение числа в степень.
Протестируйте все возможности созданного класса с 
помощью модульного тестирования (unittest).
"""


def foo():
    pass


if __name__ == '__main__':
    print(f'{desc}\n----------\n')
