desc = """
Создайте класс по работе с дробями. В классе должна 
быть реализована следующая функциональность:
■ Сложение дробей;
■ Вычитание дробей;
■ Умножение дробей;
■ Деление дробей.
Протестируйте все возможности созданного класса 
с помощью модульного тестирования (unittest). 
"""


def foo():
    pass


if __name__ == '__main__':
    print(f'{desc}\n----------\n')
