# Выведите на экран надпись Nothing will work unless you do на разных строках.
# Пример вывода:
# Nothing
# will work
# unless you do.

print("Nothing\nwill work\nunless you do")
