desc = """
Создайте класс Фильм. Необходимо хранить следующую информацию:
■ название фильма;
■ жанр;
■ режиссер;
■ год выпуска;
■ длительность;
■ студия;
■ актеры;
a) ФИО,
b) роль.
Реализуйте паттерн MVC для класса Фильм и код для 
использования модели, контроллера и представления.
"""


def foo():
    pass


if __name__ == '__main__':
    print(f'{desc}\n----------\n')
