desc = """
Создайте класс Статья. Необходимо хранить следующую информацию:
■ название статьи,
■ автор статьи,
■ количество знаков,
■ название издания или сайта, где статья была впервые опубликована,
■ краткое описание.
Создайте необходимые методы для этого класса.
Реализуйте паттерн MVC для класса Статья и код для использования модели, контроллера и представления.

"""


def foo():
    pass


if __name__ == '__main__':
    print(f'{desc}\n----------\n')
